INSERT INTO students (name, furigana, nickname, e_mail, live_municipality, age, gender, remark, is_deleted)
VALUES
('林 弥津輝', 'ハヤシ ミツテル', 'ミツ', 'mitsuteru@example.com', '岐阜市水海道', 52, '男', NULL, 0),
('田中 花子', 'タナカ ハナコ', 'ハナ', 'hanako@example.com', '大阪市北区', 25, '女', NULL, 0),
('佐藤 健', 'サトウ ケン', NULL, 'ken@example.com', '福岡市博多区', 28, '男', NULL, 0),
('山田 修', 'ヤマダ オサム', 'ヤマッチ', 'osamu@example.com', '茅野市ちの', 50, '男', NULL, 0),
('古川 歩', 'フルカワ アユミ', 'あゆみん', 'ayumi@example.com', '福岡市博多区', 36, '非公開', NULL, 0),
('伊藤 義浩', 'イトウ ヨシヒロ','ヨッシー', 'yoshihiro@example.com', '各務原市', 20, '男', NULL, 0),
('小林 礼二', 'コバヤシ レイジ','れい', 'reiji@example.com', '大阪府大阪市', 45, 'その他', NULL, 0);

INSERT INTO students_courses (status, student_id, course_name, start_date, end_date)
VALUES
('受講中', '1', 'Java入門', '2025-04-01 09:00:00', '2025-06-30 15:00:00'),
('仮申込み', '1', 'Spring Boot実践', '2025-07-01 10:00:00', NULL),
('受講中', '2', 'Python基礎', '2025-03-15 11:00:00', '2025-05-15 11:00:00'),
('受講中', '3', 'データベース設計', '2025-05-01 12:00:00', '2025-07-15 12:00:00'),
('受講中', '4', 'CAD設計', '2025-06-10 13:00:00', '2025-08-10 13:00:00'),
('受講中', '5', 'Excel VBA', '2025-06-23 14:00:00', '2025-09-30 14:00:00'),
('受講中', '6', 'Webデザイン基礎', '2025-07-09 15:00:00', '2025-08-29 15:00:00'),
('仮申込み', '4', '英会話', '2025-08-01 16:00:00',NULL),
('受講中', '7', 'Java 基礎～応用', '2025-08-05 17:00:00', '2026-02-28 16:00:00'),
('本申込み', '2', '経理・財務スキル', '2025-04-01 18:00:00', '2025-08-20 17:00:00'),
('本申込み', '3', '機械設計', '2025-07-20 19:00:00', '2026-01-30 18:00:00');